<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"e8bb1a57311ae46538cb60262c221aa304ec6e04faf021332345e7949c6e041b","plan_job_ref":"Job .github/workflows/_test-tf.yaml #64 at https://github.com/DND-IT/github-workflows/actions/runs/15509520699","plan_out_hash":"691f03f97aefe421c424dfb94aee71eb31e26e75f05392cca56a694ca2d48053","plan_hash":"f5c26c7c30059d1e455bf6c2393412162a3734ade52ccb8240ad006eb1204212","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #64](https://github.com/DND-IT/github-workflows/actions/runs/15509520699)